#### Terraform Plan 📝
```

data.terraform_remote_state.story_infra: Reading...
data.terraform_remote_state.story_infra: Read complete after 0s
aws_ecr_repository.iv_app: Refreshing state... [id=story-iv]
data.aws_security_group.ecs_tasks: Reading...
data.aws_security_group.ecs_tasks: Read complete after 0s [id=sg-0b425abdc2f594fdd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.iv_app will be created
  + resource "aws_cloudwatch_log_group" "iv_app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/story-iv"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
          + "Name"        = "story-iv-log-group"
          + "Purpose"     = "Image Generation Application Logs"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "Name"        = "story-iv-log-group"
          + "Purpose"     = "Image Generation Application Logs"
        }
    }

  # aws_ecr_lifecycle_policy.iv_app will be created
  + resource "aws_ecr_lifecycle_policy" "iv_app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 untagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "story-iv"
    }

  # aws_ecr_repository_policy.iv_app will be created
  + resource "aws_ecr_repository_policy" "iv_app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "story-iv"
    }

  # aws_ecs_service.iv_app will be created
  + resource "aws_ecs_service" "iv_app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "story-image-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "story-iv-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "story-iv-ecs-service"
          + "Purpose"     = "Image Generation Application ECS Service"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "story-iv-ecs-service"
          + "Purpose"     = "Image Generation Application ECS Service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "FARGATE"
          + weight            = 100
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0b425abdc2f594fdd",
            ]
          + subnets          = [
              + "subnet-0d71a5b4bda2a128f",
              + "subnet-0ffa2dfa3d546f109",
            ]
        }
    }

  # aws_ecs_task_definition.iv_app will be created
  + resource "aws_ecs_task_definition" "iv_app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "AWS_REGION"
                          + value = "us-east-1"
                        },
                      + {
                          + name  = "DYNAMODB_TABLE"
                          + value = "story-video-tasks"
                        },
                      + {
                          + name  = "MODEL_DIR"
                          + value = "/opt/models/sd15-onnx"
                        },
                      + {
                          + name  = "QUEUE_URL"
                          + value = "https://sqs.us-east-1.amazonaws.com/910670998600/story-sqs-queue-image"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:8080/healthz || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 120
                      + timeout     = 10
                    }
                  + image            = "910670998600.dkr.ecr.us-east-1.amazonaws.com/story-iv:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/story-iv"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "story-iv-container"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "4096"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::910670998600:role/story-tts-task-execution-role"
      + family                   = "story-iv-task"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "Name"        = "story-iv-task-definition"
          + "Purpose"     = "Image Generation Application Task Definition"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "Name"        = "story-iv-task-definition"
          + "Purpose"     = "Image Generation Application Task Definition"
        }
      + task_role_arn            = "arn:aws:iam::910670998600:role/story-tts-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_security_group.iv_app will be created
  + resource "aws_security_group" "iv_app" {
      + arn                    = (known after apply)
      + description            = "Security group for Image Generation application ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow health checks from ECS tasks"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b425abdc2f594fdd",
                ]
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "story-iv-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "Name"        = "story-iv-security-group"
          + "Purpose"     = "Image Generation Application Security Group"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "story-iv-security-group"
          + "Purpose"     = "Image Generation Application Security Group"
        }
      + vpc_id                 = "vpc-0e25a73f0a975eb98"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_port                   = 8080
  + cpu                        = 4096
  + ecr_repository_arn         = "arn:aws:ecr:us-east-1:910670998600:repository/story-iv"
  + ecr_repository_name        = "story-iv"
  + ecr_repository_url         = "910670998600.dkr.ecr.us-east-1.amazonaws.com/story-iv"
  + ecs_service_id             = (known after apply)
  + ecs_service_name           = "story-iv-service"
  + ecs_task_definition_arn    = (known after apply)
  + ecs_task_definition_family = "story-iv-task"
  + log_group_arn              = (known after apply)
  + log_group_name             = "/ecs/story-iv"
  + memory                     = 16384
  + security_group_arn         = (known after apply)
  + security_group_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

*Pusher: @shn-dev-1, Action: `pull_request`*

**Note:** This is a feature branch - only planning, no infrastructure changes will be applied.*